{"config": {"name": "model_1", "input_layers": [["context_input", 0, 0], ["response_input", 0, 0]], "layers": [{"name": "context_input", "config": {"name": "context_input", "dtype": "Int32", "batch_input_shape": [null, 120], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "response_input", "config": {"name": "response_input", "dtype": "Int32", "batch_input_shape": [null, 120], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_1", "config": {"dtype": "int32", "embeddings_constraint": null, "input_dim": 144952, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "output_dim": 64, "name": "embedding_1", "mask_zero": false, "input_length": 120, "activity_regularizer": null, "trainable": true, "embeddings_regularizer": null, "batch_input_shape": [null, 120]}, "class_name": "Embedding", "inbound_nodes": [[["context_input", 0, 0, {}]]]}, {"name": "embedding_2", "config": {"dtype": "int32", "embeddings_constraint": null, "input_dim": 144952, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "output_dim": 64, "name": "embedding_2", "mask_zero": false, "input_length": 120, "activity_regularizer": null, "trainable": true, "embeddings_regularizer": null, "batch_input_shape": [null, 120]}, "class_name": "Embedding", "inbound_nodes": [[["response_input", 0, 0, {}]]]}, {"name": "lstm_1", "config": {"return_state": false, "implementation": 0, "stateful": false, "kernel_constraint": null, "return_sequences": false, "unroll": false, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "recurrent_regularizer": null, "name": "lstm_1", "use_bias": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 64, "kernel_regularizer": null, "unit_forget_bias": true}, "class_name": "LSTM", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "lstm_2", "config": {"return_state": false, "implementation": 0, "stateful": false, "kernel_constraint": null, "return_sequences": false, "unroll": false, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "recurrent_regularizer": null, "name": "lstm_2", "use_bias": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 64, "kernel_regularizer": null, "unit_forget_bias": true}, "class_name": "LSTM", "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "dot_1", "config": {"name": "dot_1", "normalize": false, "trainable": true, "axes": [1, 1]}, "class_name": "Dot", "inbound_nodes": [[["lstm_1", 0, 0, {}], ["lstm_2", 0, 0, {}]]]}, {"name": "dense_1", "config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "units": 2, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["dot_1", 0, 0, {}]]]}], "output_layers": [["dense_1", 0, 0]]}, "class_name": "Model", "backend": "cntk", "keras_version": "2.0.4"}